Reports/ЛБ_ДействующиеКассовыеЛимиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ЛБ_ДействующиеКассовыеЛимиты</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитМакет</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ЛБ_КассовыеЛимиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_КассовыеЛимиты</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РассчетныйЛимит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийЛимит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОтделенияЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ОтделенияЛомбардов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ОтделенияЛомбардов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОтделенияЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Центральный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ЛБ_ДействующиеКассовыеЛимиты/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Отчет.ДатаНач = ТекущаяДата();
	Отчет.ДатаКон = ТекущаяДата();
	//ПериодОтчета = Истина;
КонецПроцедуры

//&НаКлиенте
//Процедура Интервал(Команда)
//	ДиалогРедактирования = Новый ДиалогРедактированияСтандартногоПериода;
//	
//	Если ДиалогРедактирования.Редактировать() Тогда
//		Отчет.ДатаНач	= ДиалогРедактирования.Период.ДатаНачала;
//		Отчет.ДатаКон 	= ДиалогРедактирования.Период.ДатаОкончания;
//	КонецЕсли;
//КонецПроцедуры

&НаКлиенте
Процедура ОтделениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуВыбора(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЛомбардНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуВыбора(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбора(Имя)
	ПараметрыФормы = новый структура;
	ПараметрыФормы.Вставить(Имя, Истина);
	ПараметрыФормы.Вставить("Дата", ?(Отчет.ДатаКон = Дата(1,1,1), КонецДня(ТекущаяДата()), КонецДня(Отчет.ДатаКон)));
	
	Если Имя = "Отделение" Тогда
		ПараметрыФормы.Вставить("Список", Отчет.Отделение);
	Иначе
		ПараметрыФормы.Вставить("Список", Отчет.Ломбард);
	КонецЕсли;
	
	ОповещениеПослеВыборка = Новый ОписаниеОповещения("ПослеВыбораЗначений", ЭтаФорма); 
	ОткрытьФорму("Отчет.ЛБ_ДействующиеКассовыеЛимиты.Форма.ФормаВыбораЗначений", ПараметрыФормы, Этаформа,,,,ОповещениеПослеВыборка,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЗначений(РезультатВыбора, ДопПараметры) Экспорт
	Если РезультатВыбора <> Неопределено И РезультатВыбора.Количество() > 0 Тогда
		
	  //СсылкаЕкт = ПолучитьСсылкуОтделения("Екатеринбург");
		Отчет.Отделение.Очистить();
		Отчет.Ломбард.Очистить();
		
		Если ТипЗнч(РезультатВыбора[0]) = Тип("СправочникСсылка.ЛБ_ОтделенияЛомбардов") Тогда
			Для каждого Стр Из РезультатВыбора Цикл
				//Если РезультатВыбора.Количество() > 1 И Стр = СсылкаЕкт Тогда
				//	Продолжить;
				//Иначе
					Отчет.Отделение.Добавить(Стр);
				//КонецЕсли;
			КонецЦикла;
		Иначе
			//ЕстьЦО = РезультатВыбора.Найти(ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис")) <> Неопределено;
			//
			//ДатаКон = ?(Отчет.ДатаКон = Дата(1,1,1), КонецДня(ТекущаяДата()), КонецДня(Отчет.ДатаКон));
			//
			//ТолькоЕкт = ПроверитьСписокВыбора(ДатаКон, РезультатВыбора, СсылкаЕкт);
			//
			//ЛомбардыЕкт = Новый Массив;
			//
			//Если НЕ ТолькоЕкт Тогда
			//	ЛомбардыЕкт = ПолучитьСписокЛомбардовЕкт(ДатаКон, СсылкаЕкт);
			//КонецЕсли;
			
			Для каждого Стр Из РезультатВыбора Цикл
				//Если НЕ ТолькоЕкт ИЛИ ЕстьЦО Тогда
				//	Если НЕ ТолькоЕкт Тогда
				//		НайденныеСтроки = ЛомбардыЕкт.Найти(Стр);
				//	КонецЕсли;
				//	
				//	Если НайденныеСтроки <> Неопределено ИЛИ Стр = ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис") Тогда
				//		Продолжить;
				//	Иначе
				//		Отчет.Ломбард.Добавить(Стр);
				//	КонецЕсли;
				//Иначе
					Отчет.Ломбард.Добавить(Стр);
				//КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	Результат.Очистить();  
	
	//ДатаНач = НачалоДня(Отчет.ДатаНач);
	//ДатаНач = ?(Отчет.ДатаНач = Дата(1,1,1), НачалоДня(ТекущаяДата()), НачалоДня(Отчет.ДатаНач));
	ДатаКон = ?(Отчет.ДатаКон = Дата(1,1,1), КонецДня(ТекущаяДата()), КонецДня(Отчет.ДатаКон));
	
	Результат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ДействующиеЛимиты";
	
	//НеЕктИлиЦО = Отчет.Ломбард <> Справочники.ЛБ_Ломбарды.ЦентральныйОфис ИЛИ СтрНайти(Отчет.Отделение.Наименование, "Екатеринбург") = 0;
	//ЕктИлиЦО = Отчет.Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис
	//	ИЛИ Отчет.Отделение.НайтиПоЗначению(Справочники.ЛБ_ОтделенияЛомбардов.НайтиПоНаименованию("Екатеринбург")) <> Неопределено;
	//
	//Если НЕ ЕктИлиЦО Тогда
		Макет = Отчет.РеквизитМакет;
	//Иначе
	//	Макет = Отчет.РеквизитМакетЕкт;
	//КонецЕсли;
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	//Если ПериодОтчета Тогда
	//	ПериодОтчетаТекст = "период с " + Формат(ДатаНач, "ДФ=dd.MM.yyyy") + " по " + Формат(ДатаКон, "ДФ=dd.MM.yyyy");
	//Иначе
		ПериодОтчетаТекст = "на " + Формат(ДатаКон, "ДФ=dd.MM.yyyy");
	//КонецЕсли;
	
	ОбластьШапка.Параметры.Период = ПериодОтчетаТекст;
	Результат.Вывести(ОбластьШапка);
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Результат.Вывести(ОбластьЗаголовок);
	
	Запрос = Новый Запрос;
	
	//Если ПериодОтчета Тогда
	//	Запрос.Текст = "ВЫБРАТЬ
	//	               |	ЛБ_КассовыеЛимиты.Отделение КАК Отделение,
	//	               |	ЛБ_КассовыеЛимиты.Ломбард КАК Ломбард,
	//	               |	ЛБ_КассовыеЛимиты.РассчетныйЛимит КАК РассчетныйЛимит,
	//	               |	ЛБ_КассовыеЛимиты.ФактическийЛимит КАК ФактическийЛимит,
	//	               |	ЛБ_КассовыеЛимиты.Ломбард.НомерЛомбарда КАК НомерЛомбарда
	//	               |ИЗ
	//	               |	РегистрСведений.ЛБ_КассовыеЛимиты КАК ЛБ_КассовыеЛимиты
	//	               |ГДЕ
	//	               |	ЛБ_КассовыеЛимиты.Период МЕЖДУ &ДатаНач И &ДатаКон
	//	               |	И ЛБ_КассовыеЛимиты.Ломбард В(&Ломбард)
	//	               |
	//	               |УПОРЯДОЧИТЬ ПО
	//	               |	ЛБ_КассовыеЛимиты.Отделение.Наименование,
	//	               |	ЛБ_КассовыеЛимиты.Ломбард.НомерЧисловой";
	//Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛБ_КассовыеЛимитыСрезПоследних.Отделение КАК Отделение,
		               |	ЛБ_КассовыеЛимитыСрезПоследних.Ломбард КАК Ломбард,
		               |	ЛБ_КассовыеЛимитыСрезПоследних.РассчетныйЛимит КАК РассчетныйЛимит,
		               |	ЛБ_КассовыеЛимитыСрезПоследних.ФактическийЛимит КАК ФактическийЛимит,
		               |	ЛБ_КассовыеЛимитыСрезПоследних.Ломбард.НомерЛомбарда КАК НомерЛомбарда
		               |ИЗ
		               |	РегистрСведений.ЛБ_КассовыеЛимиты.СрезПоследних(&ДатаКон, Ломбард В (&Ломбард)) КАК ЛБ_КассовыеЛимитыСрезПоследних
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ЛБ_КассовыеЛимитыСрезПоследних.Отделение.Наименование,
		               |	ЛБ_КассовыеЛимитыСрезПоследних.Ломбард.НомерЧисловой";
	//КонецЕсли;
	
	//Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);

	Если ЗначениеЗаполнено(Отчет.Ломбард) Тогда
		Запрос.УстановитьПараметр("Ломбард", Отчет.Ломбард);
	Иначе
		Запрос.УстановитьПараметр("Ломбард", ПолучитьСписокЛомбардов(ДатаКон, ?(ЗначениеЗаполнено(Отчет.Отделение), Отчет.Отделение.ВыгрузитьЗначения(), Неопределено)));
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Нпп = 0;
	Для каждого Стр Из РезультатЗапроса Цикл
		Если ПроверкаЧислаНаЧетность(Нпп) Тогда
			ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаЧет");
		Иначе
			ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаНечет");
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Стр);
		Результат.Вывести(ОбластьСтрока);
		Нпп = Нпп + 1;
	КонецЦикла;

	ОбластьИтого = Макет.ПолучитьОбласть("Итого");
	ОбластьИтого.Параметры.ИтогоРассчетныйЛимит = РезультатЗапроса.Итог("РассчетныйЛимит");
	ОбластьИтого.Параметры.ИтогоФактическийЛимит = РезультатЗапроса.Итог("ФактическийЛимит");
	
	Результат.Вывести(ОбластьИтого);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСписокЛомбардов(Дата, Отделение)
	
	Условие = "";
	
	Если Отделение = Неопределено Тогда
	//	Условие = "НЕ Отделение.Наименование ПОДОБНО ""%Екатеринбург%""
	//		|				И НЕ Ломбард = ЗНАЧЕНИЕ(Справочник.ЛБ_Ломбарды.ЦентральныйОфис)";
		Условие = "НЕ Ломбард.Закрыт";
	Иначе
		Условие = "Отделение В (&Отделение)
				|				И НЕ Ломбард.Закрыт";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
		|ИЗ
		|	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(
		|			&Дата,"
		+ Символы.ПС + Условие + Символы.ПС
		+ "				И НЕ Ломбард.ПометкаУдаления) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.НомерЧисловой";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Отделение", Отделение);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	СписокВозврата = Новый СписокЗначений;
	
	Пока РезультатЗапроса.Следующий() Цикл
		СписокВозврата.Добавить(РезультатЗапроса.Ломбард);
	КонецЦикла;
	
	Возврат СписокВозврата;
	
КонецФункции

&НаСервере
Функция ПроверкаЧислаНаЧетность(ВходящееЧисло) Экспорт
   РезультатВычисления = ВходящееЧисло%2 = 0; //Четное = Истина
   Возврат РезультатВычисления; //Возвращает Булево
КонецФункции

//&НаКлиенте
//Процедура ПериодОтчетаПриИзменении(Элемент)
//	Если ПериодОтчета Тогда
//		Элементы.ДатаНач.Видимость = Истина;
//		Элементы.ДатаКон.Заголовок = "По";
//		Элементы.Интервал.Видимость = Истина;
//		
//		Отчет.ДатаНач = ТекущаяДата();
//		Отчет.ДатаКон = ТекущаяДата();
//	Иначе
//		Элементы.ДатаНач.Видимость = Ложь;
//		Элементы.ДатаКон.Заголовок = "Дата";
//		Элементы.Интервал.Видимость = Ложь;
//		
//		Отчет.ДатаНач = Дата(1,1,1);
//		Отчет.ДатаКон = ТекущаяДата();
//	КонецЕсли;
//	
//КонецПроцедуры
